# -------------------------------------------------
name = "Mai Sirapob"
print(name[1:5])

# -------------------------------------------------#
#  การต่อสตริง + f-string และสตริงหลายบรรทัด
fname = "Mai"
lname = "Rak"
fullname = fname + " " + lname
print(fullname)

# -------------------------------------------------#
address = """
123 Main St, Springfield, USA
"""
print(address)

# -------------------------------------------------#
year = 2546
mes = f"เกิดเมื่อ พ.ศ. {year}"
year = 2003
print(mes)          # mes จะยังเป็น 2546 เพราะฟอร์แมตแล้วตอนสร้าง
print(type(mes))
# -------------------------------------------------#